#### In this exercise, you will use [`sqlalchemy`](https://docs.sqlalchemy.org/en/14/) to connect to a sqlite database, and write sql queries to answer questions. Sqlalchemy supports connecting to a variety of databases and database APIs, including:
- PostgreSQL
- MySQL / MariaDB
- SQLite
- Oracle
- Microsoft SQL Server

In [1]:
import pandas as pd
from sqlalchemy import create_engine

#since we are looking at poems, we'll bump up the width of our columns
pd.set_option("display.max_colwidth", 250)

### You need to connect to a database using sqlalchemy _before_ you can start writing queries
1. create a database engine using the `create_engine` method

### The basic recipe for connecting to a database using the create_engine method is
`create_engine("<dialect>://<user_name>:<password>@<hostname>/<database name>")`

**for example, if you want to connect to** 
- a database called **TB_cases** 
- on a **SQL Server** production database 
- hosted on a server at **MHDB0012.nashville.gov** 
- with username **RCarpenter** 
- and password **mn#32y!29**
- your **create_engine** function would look like this:

`create_engine('mssql+pymssql://RCarpenter:mn#32y!29@MHDB0012.nashville.gov:1433/TB_cases')`

**For our SQL exercises, you are connecting to a simple file-based sqlite database as shown below.**

In [2]:
engine = create_engine('sqlite:///../data/poetry_kids.db')

![ERD](../assets/PoetryKids_erd.png)

**We'll write a simple query to find the text of five short (char_count < 10) poems, then use the `pd.read_sql()` method to connect to the database engine and run the query.**

In [5]:
query0 = '''
            SELECT text 
            FROM poem
            WHERE char_count < 20
            LIMIT 5;
            '''

In [6]:
pd.read_sql(query0, con=engine)

             text
0    hello friend
1             bye
2  i like chicken
3   star,  star,
4  lol life rules

1. How many poems in the PoetryKids database are written by someone named Emily.  
    **Note: Names are lower case in this database!!**  
    a. decide what tables you need   
    b. decide how to connect your tables  
    c. decide which columns to select  
    d. decide what filters you want to apply in your `WHERE` clause

**Write the query, then use the `pandas` `read_sql()` method to connect to the database engine and run your query.**

In [6]:
query1 = '''
           SELECT COUNT(*) 
           FROM poem JOIN author ON poem.author_id = author.id
           WHERE author.name = 'emily';
           '''

In [7]:
pd.read_sql(query1, con=engine)

   count(*)
0       301

2. Find the **angry** poems by poets named emily.  
    a. decide what tables you need  
    b. decide how to connect your tables  
    c. decide which columns to select  
    d. decide what filters you want to apply in your `WHERE` clause

**Write the query, then use the `pandas` `read_sql()` method to connect to the database engine and run your query.**

In [8]:
query2 = '''
           SELECT author.name, emotion.name, poem.text 
           FROM author JOIN poem ON author.id = poem.author_id
                       JOIN poem_emotion ON poem.id = poem_emotion.poem_id
                       JOIN emotion ON emotion.id = poem_emotion.emotion_id
           WHERE author.name = 'emily' AND emotion.name = 'Anger';
           
           '''

In [9]:
pd.read_sql(query2, con=engine)

,name,name,text
0,emily,Anger,"i went down to see the sea and got stung by a bee. so i went up the stairs, fell, and scraped my knee. o why me???"
1,emily,Anger,why do we have wars we need not to fight we should have friends against the poor ways ways of the bad i am so sad we need to reunite upon each other every color country we are seperate the world we are together i am american peace that i sh...
2,emily,Anger,"my dear, my fair, how much i care, for your safety and love as you watch from above. you tower six feet, in the air oh so high. and you, you're so neat! i really cannot lie. my allison lee, how i care for thee. with thy large heart..."
3,emily,Anger,"catching friends is not that hard, it is just like catching fish but if you lose one that is not good, you will have to fish again! some have one others have ten. nobody has none!if you catch a mean one, catch a nice one but- ..."
4,emily,Anger,there was a tree that was blue. it had no clue what to do. it had a face like a lace. it had a wire like a tire. it had candy that was handy last of all it had a nanny.
...,...,...,...
115,emily,Anger,"someone is in my room. maybe it is a goon. or a pixie making lots of messes. i hope they don't ruin my dresses. let me take another guess. maybe it is a goblin or my friend donnegen. or something very mad. oh, its my dad!"
116,emily,Anger,"ice cream is a sweet treat! vanilla and mint chocolate chip makes my tounge do a dip cone, bowl , or sundae always makes it a fun day throwing sprinkles on top makes my taste buds want to pop! the cold makes it bold ice cream is not a dream ic..."
117,emily,Anger,"every day when i go out , i stuff my shoes with sauerkraut. then i saw a girl scout, how would always shout."
118,emily,Anger,my christmas poem this was been a wonderful year so letâ’s celebrate with christmas cheer i see the houses with colored lights and evreywhere the lights shine so bright. the snow is clear that i could see the baby deer i walked in town ...
119,emily,Anger,"the darkness melted the rich, buttery sky. the monster crept into the world and scared away all the happiness and hope, but light fought back. morning dawned on the earth"

3. Find the 5 angriest poems by an emily.  
    a. decide what tables you need   
    b. decide how to connect your tables  
    c. decide which columns to select  
    d. decide what filters you want to apply in your `WHERE` clause

**Write the query, then use the `pandas` `read_sql()` method to connect to the database engine and run your query.**

In [14]:
query3 = '''
           SELECT poem.text, poem_emotion.intensity_percent 
           FROM author JOIN poem ON author.id = poem.author_id
           JOIN poem_emotion ON poem.id = poem_emotion.poem_id
           JOIN emotion on emotion.id = poem_emotion.emotion_id
           WHERE author.name = 'emily' AND emotion.name = 'Anger'
           ORDER BY intensity_percent DESC
           LIMIT 5;
           '''

In [15]:
pd.read_sql(query3, con=engine)

,text,intensity_percent
0,"i woke up in my comfy cage, to see a parrot full of rage. his face was a bright shade of red i thought that he might have bean dead he said â“spinach is the only thing i hateâ” so i asked him if that was what he ate â“why yes that is what i ju...",91
1,some are cute and cuddly some are ugly and vicious but all the same they have no shame in anything they do,88
2,"when i look outside, i have lots of fun, i see many clouds, in the bright beating sun, i may see a duck, i may see a flower, but when my mom calls me in for dinner, i get kind of sour, but the next morning, when i woke up, my mom said,",85
3,"when i look outside i have lots of fun, i see many clouds, in the bright beating sun, i may see duck, i may see a flower, but when my mom calls me in for dinner i get sour, the next day when i woke up, mom said, going outside again i said...",85
4,"love is a beautiful thing, one day its love one day its anger. one day its true love one day its not. it could be happiness or sadness. love is a beautiful thing, enjoy it for life. love makes all things good",81

4. Find the minimum, maximum, and average length of poems by poets named emily.  
    a. decide what tables you need   
    b. decide how to connect your tables  
    c. decide which columns to select  
    d. decide what filters you want to apply in your `WHERE` clause

**Write the query, then use the `pandas` `read_sql()` method to connect to the database engine and run your query.**

In [16]:
query4 = '''
           SELECT MAX(poem.char_count), MIN(poem.char_count), AVG(poem.char_count)
           FROM author JOIN poem ON author.id = poem.author_id
           WHERE author.name = 'emily';
           '''

In [17]:
pd.read_sql(query4, con=engine)

   MAX(poem.char_count)  MIN(poem.char_count)  AVG(poem.char_count)
0                  1054                    49            221.458472